[
    {
        "bookId": 1,
        "bookName": "To Kill a Mockingbird",
        "author": "Harper Lee",
        "image": "https://blog-cdn.reedsy.com/directories/gallery/166/large_2f9efcc5c6b1207ccf5aa5b1e448530f.jpg",
        "review": "To Kill a Mockingbird is a timeless classic that explores themes of racial injustice, morality, and the loss of innocence. Set in the 1930s, in the fictional town of Maycomb, Alabama, the story is narrated by Scout Finch, a young girl who observes her father, Atticus Finch, defending a black man accused of raping a white woman. Through Scout's innocent eyes, readers witness the deep-seated prejudices and societal norms of the time. Harper Lee's masterful storytelling and compelling characters make this novel a poignant and thought-provoking read that continues to resonate with readers today.",
        "totalPages": 281,
        "rating": 4.5,
        "category": "Fiction",
        "tags": ["Social Justice", "Coming of Age"],
        "publisher": "J. B. Lippincott & Co.",
        "yearOfPublishing": 1960
    },
    {
        "bookId": 2,
        "bookName": "1984",
        "author": "George Orwell",
        "image": "https://blog-cdn.reedsy.com/directories/gallery/165/large_270f8ccdb3e534a7079fb4aca9d20234.jpg",
        "review": "1984 is a dystopian novel that paints a chilling portrait of a totalitarian society where individuality and freedom are suppressed by a tyrannical government. Set in a future world divided into three superstates, the story follows Winston Smith, a low-ranking member of the ruling Party who rebels against its oppressive regime. George Orwell's prophetic vision of surveillance, propaganda, and thought control remains as relevant today as it was when the novel was first published.",
        "totalPages": 328,
        "rating": 4.6,
        "category": "Science Fiction",
        "tags": ["Dystopian", "Totalitarianism"],
        "publisher": "Secker & Warburg",
        "yearOfPublishing": 1949
    },
    {
        "bookId": 3,
        "bookName": "The Great Gatsby",
        "author": "F. Scott Fitzgerald",
        "image": "https://blog-cdn.reedsy.com/directories/gallery/162/large_258cf9c56fb1b3ec7d3667cf474435c6.jpg",
        "review": "The Great Gatsby is a mesmerizing tale of love, ambition, and the American Dream set amidst the extravagance of the Roaring Twenties. Narrated by Nick Carraway, the story follows Jay Gatsby, a mysterious millionaire who becomes entangled in a web of obsession and tragedy. F. Scott Fitzgerald's lyrical prose and vivid imagery capture the decadence and disillusionment of the Jazz Age, making The Great Gatsby a timeless masterpiece.",
        "totalPages": 180,
        "rating": 4.7,
        "category": "Classic",
        "tags": ["Romance", "Wealth"],
        "publisher": "Charles Scribner's Sons",
        "yearOfPublishing": 1925
    },
    {
        "bookId": 4,
        "bookName": "Pride and Prejudice",
        "author": "Jane Austen",
        "image": "https://blog-cdn.reedsy.com/directories/gallery/161/large_812f895eef417f4c3d73d26befe511ff.jpg",
        "review": "Pride and Prejudice is a delightful comedy of manners that follows the romantic entanglements of the Bennet sisters in early 19th-century England. At its heart is the spirited Elizabeth Bennet, whose wit and intelligence clash with the proud and enigmatic Mr. Darcy. Jane Austen's sparkling dialogue and keen social commentary make this novel a timeless classic that continues to charm readers with its wit and wisdom.",
        "totalPages": 279,
        "rating": 4.8,
        "category": "Romance",
        "tags": ["Regency Era", "Satire"],
        "publisher": "T. Egerton, Whitehall",
        "yearOfPublishing": 1813
    },
    {
        "bookId": 5,
        "bookName": "The Catcher in the Rye",
        "author": "J.D. Salinger",
        "image": "https://blog-cdn.reedsy.com/directories/gallery/156/large_7fc2657c08cb5716eea4cd044735f5ca.jpg",
        "review": "The Catcher in the Rye is a poignant coming-of-age novel that follows the misadventures of Holden Caulfield, a disillusioned teenager navigating the phoniness of adult society. Set in the post-World War II era, the story captures the angst and alienation of youth with raw honesty and sardonic humor. J.D. Salinger's iconic protagonist and distinctive narrative voice have made this novel a cultural touchstone for generations.",
        "totalPages": 224,
        "rating": 4.4,
        "category": "Coming of Age",
        "tags": ["Alienation", "Teenage Rebellion"],
        "publisher": "Little, Brown and Company",
        "yearOfPublishing": 1951
    },
    {
        "bookId": 6,
        "bookName": "The Hobbit",
        "author": "J.R.R. Tolkien",
        "image": "https://blog-cdn.reedsy.com/directories/gallery/152/large_0a5b75545a621ae63dcf8f91ac97d955.jpg",
        "review": "The Hobbit is a captivating fantasy adventure that follows the journey of Bilbo Baggins, a reluctant hobbit who is swept into an epic quest to reclaim the lost kingdom of Erebor from the fearsome dragon Smaug. Along the way, Bilbo encounters trolls, goblins, elves, and a mysterious creature named Gollum, testing his courage and resourcefulness. J.R.R. Tolkien's enchanting tale is filled with rich world-building, memorable characters, and timeless themes of heroism and friendship.",
        "totalPages": 310,
        "rating": 4.9,
        "category": "Fantasy",
        "tags": ["Adventure", "Quest"],
        "publisher": "George Allen & Unwin",
        "yearOfPublishing": 1937
    },
    {
        "bookId": 7,
        "bookName": "To the Lighthouse",
        "author": "Virginia Woolf",
        "image": "https://blog-cdn.reedsy.com/directories/gallery/149/large_731b19255102c27436a5d5bdcd2cdce2.jpg",
        "review": "To the Lighthouse is a lyrical exploration of the complexities of human relationships and the passage of time. Set on the Isle of Skye, the novel follows the Ramsay family and their guests as they grapple with love, loss, and the elusive nature of truth. Virginia Woolf's innovative narrative style, characterized by stream-of-consciousness prose and shifting perspectives, immerses readers in the characters' inner thoughts and emotions, creating a deeply introspective and evocative reading experience.",
        "totalPages": 209,
        "rating": 4.7,
        "category": "Modernist Fiction",
        "tags": ["Family", "Monologue"],
        "publisher": "Hogarth Press",
        "yearOfPublishing": 1927
    },
    {
        "bookId": 8,
        "bookName": "Moby-Dick",
        "author": "Herman Melville",
        "image": "https://blog-cdn.reedsy.com/directories/gallery/147/large_d7ee27be311c14390511e993d0ef0898.jpg",
        "review": "Moby-Dick is an epic tale of obsession and revenge that follows the vengeful quest of Captain Ahab for the elusive white whale that took his leg. Set aboard the whaling ship Pequod, the story delves into themes of fate, destiny, and the inherent conflict between man and nature. Herman Melville's richly symbolic narrative and profound philosophical insights have cemented Moby-Dick as one of the greatest American novels ever written.",
        "totalPages": 624,
        "rating": 4.6,
        "category": "Adventure",
        "tags": ["Whaling", "Existentialism"],
        "publisher": "Richard Bentley",
        "yearOfPublishing": 1851
    },
    {
        "bookId": 9,
        "bookName": "The Lord of the Rings",
        "author": "J.R.R. Tolkien",
        "image": "https://blog-cdn.reedsy.com/directories/gallery/138/large_88c240e50b8e511ba0857d6df2778a3a.jpg",
        "review": "The Lord of the Rings is an epic fantasy trilogy that chronicles the quest to destroy the One Ring and defeat the Dark Lord Sauron. Set in the fictional world of Middle-earth, the story follows hobbit Frodo Baggins and his companions as they journey across the land to Mount Doom. J.R.R. Tolkien's intricate world-building, complex characters, and epic battles make The Lord of the Rings a timeless masterpiece of fantasy literature.",
        "totalPages": 1178,
        "rating": 4.9,
        "category": "Fantasy",
        "tags": ["Epic", "Quest"],
        "publisher": "George Allen & Unwin",
        "yearOfPublishing": 1954
    }
]
